/******************************************************************************
 *  ファイル名：RunDistJudge.cpp
 *　　　　内容：走行距離判定クラスの定義
 *  　　作成日：2024/10/22
 *  　　作成者：近藤　悠太
 *****************************************************************************/

#include "RunDistJudge.h"


/******************************************************
 *  関数名：コンストラクタ
 *    概要：インスタンス生成時の処理をする
 *  　引数：オドメーター、目標の走行距離
 *  返却値：なし
 *  　備考：なし
 ******************************************************/
RunDistJudge::RunDistJudge(RunDistMeasure* odometer, float trgt_dst)
    : mOdometer(odometer), target_dist(trgt_dst)
{
    ;
}

/******************************************************
 *  関数名：Judge
 *    概要：終了条件の判定をする
 *  　引数：なし
 *  返却値：終了条件を満たした：true、満たしてない：false
 *  　備考：なし
 ******************************************************/
bool RunDistJudge::judge()
{
    current_dist = mOdometer->measureRunDist();

    if (current_dist > target_dist)
    {
        return true;
    }
    else
    {
        return false;
    }
}
