/******************************************************************************
 *  ファイル名：Scene.cpp
 *　　　　内容：シーンクラスの定義
 *  　　作成日：2024/10/22
 *  　　作成者：近藤　悠太
 *****************************************************************************/

#include "Scene.h"  // ヘッダインクルード


/******************************************************
 *  関数名：コンストラクタ
 *    概要：インスタンス生成時の処理をする
 *  　引数：各シーンに応じた走行、各シーンに応じた判定
 *  返却値：なし
 *  　備考：なし
 ******************************************************/
Scene::Scene(Run* runforscene, Judge* judgeforscene)
    : mRunForScene(runforscene), mJudgeForScene(judgeforscene), fin_flag(false)
{
    ;
}

/******************************************************
 *  関数名：exeScene
 *    概要：シーンに応じた走行と判定を実行する
 *  　引数：なし
 *  返却値：なし
 *  　備考：なし
 ******************************************************/
void Scene::exeScene()
{
    mRunForScene->run();
    fin_flag = mJudgeForScene->judge();
}

/******************************************************
 *  関数名：checkFlag
 *    概要：シーン終了フラグを確認する
 *  　引数：なし
 *  返却値：シーン終了フラグの状態
 *  　備考：const
 ******************************************************/
bool Scene::checkFlag() const
{
    return fin_flag;
}
